In [19]:
import pandas as pd

In [20]:
df = pd.read_csv("stock_returns.csv")
df

   year  nvidia_returns  reliance_returns
0  2016          122.14             47.43
1  2017           83.91             12.09
2  2018          -50.03            -13.63
3  2019           82.19             22.42
4  2020          125.84             62.59
5  2021           50.53             33.70
6  2022           48.57             10.26

In [21]:
df.describe()

              year  nvidia_returns  reliance_returns
count     7.000000        7.000000          7.000000
mean   2019.000000       66.164286         24.980000
std       2.160247       59.611670         25.412166
min    2016.000000      -50.030000        -13.630000
25%    2017.500000       49.550000         11.175000
50%    2019.000000       82.190000         22.420000
75%    2020.500000      103.025000         40.565000
max    2022.000000      125.840000         62.590000

In [22]:
df.nvidia_returns.std(), df.nvidia_returns.var()

(np.float64(59.61166995847453), np.float64(3553.551195238095))

In [23]:
df.reliance_returns.std(), df.reliance_returns.var()

(np.float64(25.41216637754444), np.float64(645.7782000000001))

In [24]:
df_score =pd.read_excel("cricket_scores.xlsx")
df_score

                 match  shubman_gill  rohit_sharma
0    India vs Pakistan            10            11
1       India vs Nepal            67            74
2    India vs Pakistan            58            56
3   India vs Sri Lanka            19            53
4  India vs Bangladesh           121             0
5   Indis vs Australia            74            81

In [25]:
df_score.describe()

       shubman_gill  rohit_sharma
count      6.000000      6.000000
mean      58.166667     45.833333
std       40.325757     33.162730
min       10.000000      0.000000
25%       28.750000     21.500000
50%       62.500000     54.500000
75%       72.250000     69.500000
max      121.000000     81.000000

In [26]:
df_score['shubman_gill'].std(), df_score['shubman_gill'].var()

(np.float64(40.32575686415156), np.float64(1626.1666666666665))

In [27]:
df_score['rohit_sharma'].std(), df_score['rohit_sharma'].var()

(np.float64(33.16273008463969), np.float64(1099.7666666666667))